Repository: t2ym/i18n-behavior
Catalog: demo/poc/xliff/bundle.*.xlf
Languages: fr

# el5.label1
source: Bound UI label 1
fr: fr Bound UI label 1

# el5.label2
source: Bound UI label 2
fr: fr Bound UI label 2

# el5.label3
source: Bound UI label 3
fr: fr Bound UI label 3

# i18n-behavior-demo.model.simple-input.placeholder
source: Placeholder String
fr: texte d'espace réservé

# i18n-behavior-demo.model.data.sender.name
source: Joe
fr: Joseph

# i18n-behavior-demo.model.data.recipients.0.name
source: Alice
fr: Alis

# i18n-behavior-demo.model.data.recipients.1.name
source: Bob
fr: Robert

# i18n-behavior-demo.h2_1
source: Simple String
fr: Texte simple

# i18n-behavior-demo.simple
source: UI Text String
fr: UI texte

# i18n-behavior-demo.h2_3
source: Simple Attribute
fr: Attribut simple

# i18n-behavior-demo.h2_5
source: Automatic Format
fr: Format automatique

# i18n-behavior-demo.example-sentence.0
source: This {1} with {2} is automatically converted to {3} to translate it as a whole with any parameter order.
fr: Cette {1} avec {2} est automatiquement converti en {3} pour qu'il soit traduit dans son ensemble à un ordre de paramètre.

# i18n-behavior-demo.example-sentence.1
source: example sentence
fr: phrase d'exemple

# i18n-behavior-demo.example-sentence.2
source: some parameters or embedded tags
fr: des paramètres ou des balises embarquées

# i18n-behavior-demo.h2_7
source: Compound Format with <i18n-format>
fr: Composé Format avec <i18n-format>

# i18n-behavior-demo.compound-format-text.0.0
source: You ({3}) gave no gifts.
fr: Vous ({3}) avez pas de cadeau.

# i18n-behavior-demo.compound-format-text.0.1.male
source: You ({3}) gave him ({4}) {5}.
fr: Vous ({3}) lui a donné ({4}) {5}.

# i18n-behavior-demo.compound-format-text.0.1.female
source: You ({3}) gave her ({4}) {5}.
fr: Vous ({3}) lui avez donné ({4}) {5}.

# i18n-behavior-demo.compound-format-text.0.1.other
source: You ({3}) gave them ({4}) {5}.
fr: Vous ({3}) leur a donné ({4}) {5}.

# i18n-behavior-demo.compound-format-text.0.one.male
source: You ({3}) gave him ({4}) and one other person {5}.
fr: Vous ({3}) lui a donné ({4}) et une autre personne {5}.

# i18n-behavior-demo.compound-format-text.0.one.female
source: You ({3}) gave her ({4}) and one other person {5}.
fr: Vous ({3}) lui avez donné ({4}) et une autre personne {5}.

# i18n-behavior-demo.compound-format-text.0.one.other
source: You ({3}) gave them ({4}) and one other person {5}.
fr: Vous ({3}) leur a donné ({4}) et une autre personne {5}.

# i18n-behavior-demo.compound-format-text.0.other
source: You ({3}) gave them ({4}) and {1} other people gifts.
fr: Vous ({3}) leur a donné ({4}) et {1} autres cadeaux personnes.

# i18n-behavior-demo.compound-format-text.5
source: a gift
fr: un cadeau

# i18n-behavior-demo.h2_9
source: Parameters
fr: Paramètres

# i18n-behavior-demo.pre_10.2
source: {{langName}}
fr: {{_getLangName(effectiveLang,text.langNames)}}

# i18n-behavior-demo.pre_11.1
source: {{stringifiedUser}}
fr: {{_getStringifiedUser(model.data.sender)}}

# i18n-behavior-demo.pre_12.1
source: {{stringifiedRecipients}}
fr: {{_getStringifiedRecipients(recipients)}}

# i18n-behavior-demo.langNames.en
source: English
fr: anglais

# i18n-behavior-demo.langNames.ja
source: Japanese
fr: japonais

# i18n-behavior-demo.langNames.fr
source: French
fr: français

# i18n-legacy-element.label1
source: Legacy UI label 1
fr: fr Legacy UI label 1

# i18n-legacy-element.label2
source: Legacy UI label 2
fr: fr Legacy UI label 2

# i18n-legacy-element.label3
source: Legacy UI label 3
fr: fr Legacy UI label 3

# i18n-subclass-element.model.input_8.i18n-attr
source: i18n attr
fr: fr i18n attr

# i18n-subclass-element.label1
source: Subclass UI label 1
fr: fr Subclass UI label 1

# i18n-subclass-element.label2
source: Subclass UI label 2
fr: fr Subclass UI label 2

# i18n-subclass-element.label3
source: Subclass UI label 3
fr: fr Subclass UI label 3

# i18n-subclass-element.span_6.0
source: complex {1} sentences {2}
fr: fr complex {1} sentences {2}

# i18n-subclass-element.span_6.1
source: parameterized
fr: fr parameterized

# i18n-subclass-element.span_6.2
source: abc
fr: fr abc

# i18n-thin-element.label1
source: Thin UI label 1
fr: fr Thin UI label 1

# i18n-thin-element.label2
source: Thin UI label 2
fr: fr Thin UI label 2

# i18n-thin-element.label3
source: Thin UI label 3
fr: fr Thin UI label 3

# localizable-element.label1
source: Localizable UI label 1
fr: fr Localizable UI label 1

# localizable-element.label2
source: Localizable UI label 2
fr: fr Localizable UI label 2

# localizable-element.label3
source: Localizable UI label 3
fr: fr Localizable UI label 3
